package com.qidate.qisplan2.ghost.possession.classification;

public enum GhostTag {

    /*
     * ============================================================
     * 灵异本质
     * ============================================================
     */

    /**
     * 实体鬼。
     *
     * 灵异拥有明确的实体存在形式。
     */
    ENTITY,

    /**
     * 唯心鬼。
     *
     * 灵异并不依赖普通实体作为主要存在形式。
     */
    IDEALISTIC,


    /*
     * ============================================================
     * 存在形态
     * ============================================================
     */

    /**
     * 存在形体。
     *
     * 表示该鬼拥有明确的“存在形体”。
     */
    EXISTENCE_FORM,


    /*
     * ============================================================
     * 具体形态
     * ============================================================
     */

    /**
     * 器官。
     */
    ORGAN,

    /**
     * 眼。
     */
    EYE,

    /**
     * 影子。
     */
    SHADOW,

    /**
     * 身体 / 肉身。
     */
    BODY,

    /**
     * 手。
     */
    HAND,

    /**
     * 门。
     */
    DOOR,

    /**
     * 概念。
     */
    CONCEPT
}